#Напишите функцию fizz_buzz, которая принимает один аргумент — n (число).
#Функция должна печатать числа от 1 до n. При этом:
#если число делится на 3, печатать Fizz;
#если число делится на 5, печатать Buzz;
#если число делится на 3 и на 5, печатать FizzBuzz.


def fizz_buzz(n: int) -> None:
       
    for i in range(1, n + 1):
        if i % 15 == 0:          # делится и на 3, и на 5 (15 = 3 * 5)
            print("FizzBuzz")
        elif i % 3 == 0:         # делится на 3
            print("Fizz")
        elif i % 5 == 0:         # делится на 5
            print("Buzz")
        else:                    # не делится ни на 3, ни на 5
            print(i)


if __name__ == "__main__":
    fizz_buzz(30)